aaron-bond.better-comments
anthropic.claude-code
beardedbear.beardedicons
beardedbear.beardedtheme
catppuccin.catppuccin-vsc
christian-kohler.path-intellisense
davidanson.vscode-markdownlint
docker.docker
drblury.protobuf-vsc
editorconfig.editorconfig
formulahendry.auto-close-tag
formulahendry.auto-rename-tag
github.copilot
github.copilot-chat
golang.go
jinliming2.vscode-go-template
maikkundev.quick-run-debug-buttons
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-dotnettools.csdevkit
ms-dotnettools.csharp
ms-dotnettools.vscode-dotnet-runtime
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.remote-explorer
mtxr.sqltools
mtxr.sqltools-driver-pg
mtxr.sqltools-driver-sqlite
nhoizey.gremlins
patbenatar.advanced-new-file
pkief.material-product-icons
redhat.vscode-yaml
streetsidesoftware.code-spell-checker
streetsidesoftware.code-spell-checker-french
tamasfe.even-better-toml
tomrijndorp.find-it-faster
usernamehw.errorlens
vadimcn.vscode-lldb
wakatime.vscode-wakatime
ziglang.vscode-zig
